# **`Data Science Learners Hub`**

**Module : SQL**

**email** : [datasciencelearnershub@gmail.com](mailto:datasciencelearnershub@gmail.com)

### **# `SET`, `DECLARE`, and `OUTPUT` in SQL:**

**1. Introduction:**

In SQL, `SET`, `DECLARE`, and `OUTPUT` are used to handle variables, store values, and capture the results of queries. Understanding these concepts is fundamental for managing data and performing dynamic operations in SQL.

**2. Why Learn This Topic:**

Learning about `SET`, `DECLARE`, and `OUTPUT` is crucial as they provide a way to store and manipulate data within SQL scripts. This is essential for building dynamic queries, performing calculations, and efficiently managing data during script execution.

**3. Real-world Applications:**

Consider a scenario where you need to calculate and store intermediate results in a complex financial transaction or in an inventory management system. Variables and output parameters become valuable tools to handle and process data dynamically.

**4. Syntax and Examples:**

1. **`SET`:**
   - Used to assign a value to a variable or set the value of a system variable.
   ```sql
   SET @variable_name = value;
   ```
   Example:
   ```sql
   SET @counter = 1;
   ```

2. **`DECLARE`:**
   - Used to declare a variable along with its data type.
   ```sql
   DECLARE @variable_name data_type;
   ```
   Example:
   ```sql
   DECLARE @total_sales DECIMAL(10, 2);
   ```

3. **`OUTPUT`:**
   - Used with stored procedures to return values back to the calling program.
   ```sql
   CREATE PROCEDURE procedure_name
   @input_parameter data_type,
   @output_parameter data_type OUTPUT
   AS
   -- Procedure logic here
   ```
   Example:
   ```sql
   CREATE PROCEDURE GetTotalSales
   @startDate DATE,
   @totalSales DECIMAL(10, 2) OUTPUT
   AS
   -- Procedure logic to calculate total sales
   ```

**5. Understanding SET, DECLARE, and OUTPUT:**

- `SET` is used for simple assignment operations.
- `DECLARE` is used to define variables before they are used in a script or stored procedure.
- `OUTPUT` is commonly used in stored procedures to return values. Captures and returns results of data modifications, such as inserted or deleted rows.

**6. Practical Applications:**

- `Dynamic calculations`: Discount prices, apply taxes, adjust quantities based on conditions.

- `Temporary storage`: Hold intermediate results or values for later use.

- `Audit trails`: Capture changes for logging or tracking purposes.

- `Data synchronization`: Replicate or transfer data between tables or databases.

 **7. Considerations**:

- `Scope of variables`: Declared within blocks (e.g., stored procedures, batches), not globally.

- `OUTPUT clause`: Limited to data modification statements (INSERT, UPDATE, DELETE).

- `Performance implications`: Use cautiously with large datasets.

**7. Common Mistakes:**

- Forgetting to declare a variable using `DECLARE` before using it in a script.

- Incorrectly using `SET` to declare a variable. `DECLARE` is the appropriate keyword for variable declaration.

- Expecting `OUTPUT` to return results for queries without data modification.

**8. Hands-on Experience:**

Let's create a sample table and use these concepts:

In [1]:
USE DataScienceLearnersHub

In [7]:
DROP TABLE employee

In [8]:
-- Creating a Sample Table
CREATE TABLE employee (
    employee_id INT PRIMARY KEY,
    employee_name VARCHAR(50),
    salary DECIMAL(10, 2)
);

-- Inserting Sample Data
INSERT INTO employee VALUES (1, 'Laxman Rathod', 50000.00), (2, 'Naina Rathod', 60000.00);

SELECT * FROM employee

employee_id,employee_name,salary
1,Laxman Rathod,50000.00
2,Naina Rathod,60000.00

Now, let's use `SET` and `DECLARE`:

In [13]:
-- Using SET to Assign Values
SET @counter = 1;

-- Using DECLARE to Define Variables
DECLARE @totalSalary DECIMAL(10, 2);
SET @totalSalary = 0;

: Msg 137, Level 15, State 1, Line 2
Must declare the scalar variable "@counter".

**Note :** You are getting the above error because the variable `@counter` is not declared before using it

In [14]:
-- Corrected Declaration of @counter
DECLARE @counter INT;
SET @counter = 1;

-- Using DECLARE to Define Variables
DECLARE @totalSalary DECIMAL(10, 2);
SET @totalSalary = 0;

**Questions Based on the Table:**

**Question 1. Incremental Salary Calculation:**
   - Use `SET` to increment the salary of all employees by 10%.

In [16]:
DECLARE @counter INT;
SET @counter = 1;
WHILE @counter <= (SELECT COUNT(*) FROM employee)
BEGIN
    UPDATE employee
    SET salary = salary * 1.1
    WHERE employee_id = @counter;

    SET @counter = @counter + 1;
END;

**Question 2. Total Salary Calculation:**
   - Use `DECLARE` to define a variable for total salary and calculate the sum of all salaries in the `employee` table.

In [17]:
DECLARE @totalSalary DECIMAL(10, 2);
SET @totalSalary = 0;

SELECT @totalSalary = @totalSalary + salary
FROM employee;

PRINT 'Total Salary: ' + CAST(@totalSalary AS VARCHAR(20));

**Question 3. Conditional Update:**
   - Use `SET` to update the salary of employees based on a condition, e.g., increase the salary by 15% for employees with a salary less than 55000.00.

In [18]:
UPDATE employee
SET salary = salary * 1.15
WHERE salary < 55000.00;

**Question 4. Stored Procedure with OUTPUT:**
   - Create a stored procedure that takes an employee ID as input, retrieves the employee's name and salary, and outputs the salary.

`Note` : Stored procedure is not yet discussed, same will be discussed in detail in next topic. So not to worry

In [19]:
CREATE PROCEDURE GetEmployeeSalary
    @employeeID INT,
    @employeeName VARCHAR(50) OUTPUT,
    @employeeSalary DECIMAL(10, 2) OUTPUT
AS
BEGIN
    SELECT @employeeName = employee_name, @employeeSalary = salary
    FROM employee
    WHERE employee_id = @employeeID;
END;

Now, To execute the stored procedure:

In [20]:
DECLARE @empName VARCHAR(50);
DECLARE @empSalary DECIMAL(10, 2);

EXEC GetEmployeeSalary @employeeID = 1, @employeeName = @empName OUTPUT, @employeeSalary = @empSalary OUTPUT;

PRINT 'Employee Name: ' + @empName;
PRINT 'Employee Salary: ' + CAST(@empSalary AS VARCHAR(20));

**9. Homework Assignment:**

1. **Dynamic Salary Update:**
   - Write a script that dynamically updates the salary of an employee. Use user input or a parameterized query to specify the employee ID and the new salary.

2. **Total Salary Calculation in a Stored Procedure:**
   - Create a stored procedure that calculates the total salary for all employees and outputs the result.

3. **Conditional Variable Declaration:**
   - Write a script that declares a variable based on a condition. For example, declare a variable with the data type `INT` if the salary is less than 60000.00, otherwise declare it as `DECIMAL(10, 2)`.

4. **Stored Procedure with Multiple OUTPUT Parameters:**
   - Enhance the stored procedure from the hands-on experience to include multiple `OUTPUT` parameters, such as the total number of employees.

5. **Advanced Dynamic Scripting:**
   - Explore advanced dynamic scripting by writing a script that generates dynamic SQL statements based on certain conditions. Use `SET` to execute the dynamic statements.

**10. Do you know ?**

Did you know that `SET` and `DECLARE` are fundamental building blocks for dynamic SQL scripting? In more complex scenarios, dynamic SQL allows you to build and execute SQL statements dynamically, enhancing the flexibility and versatility of your scripts. Understanding these concepts is a gateway to mastering dynamic SQL in SQL Server.